Revit 2024 API
FabricationVersionInfo.Reason Property
 The user-specified reason for the change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public string Reason { get; }
Visual Basic
Public ReadOnly Property Reason As String
	Get
Visual C++
public:
property String^ Reason {
	String^ get ();
}
See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace